{
    "newschannelId": 807311087740649522,
    "04-Feb-2022": "Library Services During COVID-19",
    "20-Feb-2022": "Recommendations of the Implementation Committee on National Education Policy 2020, University of Delhi",
    "03-May-2022": "In Memoriam",
    "12-May-2022": "Delhi University selected as a \"GATI Charter Institution\" of DST",
    "15-May-2022": "Delhi University Teachers Welfare Fund (DUTWF)",
    "09-Jun-2022": "DU in QS World Ranking 2022",
    "12-Jun-2022": "Prof GVR Prasad, Department of Geology, won the prestigious and highly competitive Fulbright-Nehru Academic & Professional Excellence Fellowship",
    "14-Jun-2022": "Prof SD Biju, Department of Environmental Studies, features in The Week magazine as part of the cover story on Western Ghats and its biodiversity.  Prof Biju has identified nearly 100 new species of frogs and most of them are in the Western Ghats",
    "22-Jun-2022": "Revised Academic Calendar for the first year of Undergraduate and Postgraduate Courses for the Academic Year 2020-21",
    "23-Jun-2022": "Notice regarding empanelled Authorized Medical Attendants (AMAs) and Hospitals/Diagnostic Centres",
    "24-Jun-2022": "Academic Calendar for V, VI, VII &amp; VIII semesters of Undergraduate and Postgraduate Courses for the Academic Year 2021 - 22",
    "29-Jun-2022": "Foundation Day Awards May 2021",
    "30-Jun-2022": "Press Release - Felicitation of Principals of 16 Colleges of DU listed in the India Today ranking 2021",
    "01-Jul-2022": "Press Release - National Doctors' Day",
    "05-Jul-2022": "Results of U.G. and P.G Programmes for Session May-June 2021 Sem-II, IV, VI",
    "11-Jul-2022": "Breakthrough Research in treatment of Parkinson's Disease",
    "12-Jul-2022": "A comprehensive online training of SciFinder-n for students, researchers & faculty members University of Delhi",
    "17-Jul-2022": "Press Release - Admissions for the Academic Session - 2021-2022",
    "22-Jul-2022": "World Health Day 2021",
    "02-Aug-2022": "A tiny new species of frog from the Western Ghats named after former Vice Chancellor of Delhi University",
    "05-Aug-2022": "University of Delhi signs MoU with University of Ladakh",
    "07-Aug-2022": "Press Release - Planting a Tree is part of New Curriculum in University of Delhi",
    "09-Aug-2022": "Academic Calendar for III & IV semesters of relevant Undergraduate and Postgraduate Courses for the Academic Year 2021 - 22",
    "15-Aug-2022": "75th Independence Day Celebration & Commemoration of the First Vice Chancellor of University of Delhi",
    "17-Aug-2022": "Press Release - Delhi University efforts to Save Himalayas",
    "18-Aug-2022": "CPS Internship Program - Cyber Physical Systems (CPS) Lab at Institute of Informatics & Communication, University of Delhi invites applications for Internships",
    "19-Aug-2022": "Press Release - Afghanistan Students",
    "23-Aug-2022": "Notification, Provisional List of Applicants who have applied for Employment and Proforma for employment under Compassionate Appointment",
    "30-Aug-2022": "India’s Yogesh Kathuniya (B.Com graduate from DU's Kirorimal College) wins silver in men’s discus throw F56 at Tokyo Paralympics",
    "01-Sep-2022": "FAKE Office Order",
    "06-Sep-2022": "Office Order - Phased reopening of the University of Delhi Colleges, Departments and Centres",
    "07-Sep-2022": "Advisory on Post-COVID-19 Respiratory Management - W.U.S. Health Centre",
    "09-Sep-2022": "W.U.S. Health Centre Advisory on Healthy Heart Beat : Healthy Blood Pressure. Control your Blood Pressure : Control your life",
    "20-Sep-2022": "FAKE Office Order - Phased reopening of DU Colleges, Departments and Centres",
    "21-Sep-2022": "Notification - National Education Policy (NEP) Interdisciplinary Courses Committee",
    "23-Sep-2022": "Press Release - Foundation Stones of two \"Student Facilitation Centres\"",
    "24-Sep-2022": "Advisory on World Heart Day 2021",
    "01-Oct-2022": "Press Release - 1st Cut-Off List - 2021-2022",
    "07-Oct-2022": "Press Release - First Round of Admissions 2021-2022",
    "08-Oct-2022": "Notification - Prof. Yogesh Singh has assumed the Charge as the Vice Chancellor, University of Delhi",
    "09-Oct-2022": "Press Release - 2nd Cut-Off List - 2021-2022",
    "12-Oct-2022": "Advisory on Air Pollution",
    "16-Oct-2022": "Press Release - 3rd Cut-Off List 2021",
    "22-Oct-2022": "Notification - Appointment of Nodal Officer for Campaign titled \"Know Your Rivers\" \"नदी को जानो\"",
    "25-Oct-2022": "Press Release - Special Cut-Off List 2021",
    "28-Oct-2022": "Delhi University bags the Clarivate India Research Excellence Citations Award 2021",
    "29-Oct-2022": "Press Release - 1st Cut-Off List - 2021 - NCWEB",
    "30-Oct-2022": "Press Release - 4th Cut-Off List 2021",
    "01-Nov-2022": "Notification regarding Biometric Attendance",
    "08-Nov-2022": "Press Release - 5th Cut-Off List 2021",
    "09-Nov-2022": "Academic Calendar for First year of Postgraduate Courses for the Academic Year 2021 - 22",
    "12-Nov-2022": "Regarding remuneration of contractual staff",
    "13-Nov-2022": "Press Release - Special Drive Cut-Off List 2021",
    "15-Nov-2022": "Press Release - 3rd Cut-Off List - 2021 - NCWEB",
    "17-Nov-2022": "संगोष्ठी एवं पुस्तक विमोचन - इंस्टिट्यूट ऑफ़ लाइफ लॉन्ग लर्निंग - नवंबर 18, 2021",
    "18-Nov-2022": "Webinar on “Power your Research with Scopus” (November 23, 2021)",
    "20-Nov-2022": "Press Release - Measures for Prevention of Ragging - 2021-2022",
    "24-Nov-2022": "Press Release - 2nd Special Drive Cut-Off List 2021",
    "26-Nov-2022": "Delhi University Scholarships for the Academic Year 2021-22",
    "27-Nov-2022": "Online Launch of DU eLibrary (December 03, 2021)",
    "01-Dec-2022": "Press Release - Fourth Cut-Off List - 2021 - NCWEB",
    "03-Dec-2022": "Press Release - 3rd Special Drive Cut-Off List 2021-2022",
    "08-Dec-2022": "Press Release - Fifth Cut-Off List - 2021 - NCWEB",
    "09-Dec-2022": "Obituary - General Bipin Rawat, Chief of Defence Staff",
    "10-Dec-2022": "Press Release - Inviting online applications for appointment of Guest Faculty for Teaching Centres of the NCWEB, University of Delhi",
    "13-Dec-2022": "Advertisement for the post of Assistant Professor against the Advt. No. Estab.IV/291/2021 dated 20.09.2021 (Last date of Application extended till till 24.12.2021)",
    "14-Dec-2022": "Regarding Recruitment Rules (Non-Teaching Employees) 2020 (Updated on 14.12.2021)",
    "15-Dec-2022": "Press Release - 2nd Special Cut-Off List 2021-2022 - NCWEB",
    "16-Dec-2022": "Press Release - Open House Discussion on NEP 2020",
    "17-Dec-2022": "Notifications and Office Orders",
    "20-Dec-2022": "Notification - Admissions 2022-2023 - CUCET - DUCET",
    "21-Dec-2022": "Corona Virus Variant – Omicron : ‘Variant of Concern’ (VoC) “Very High Global Risk”",
    "23-Dec-2022": "Press Release - 6th Cut-Off List - 2021 - NCWEB",
    "24-Dec-2022": "Appointment of Nodal Officer for Evaluation Work for translation",
    "30-Dec-2022": "Notification regarding the constitution of committee to consider the proposal of establishment of Institute of Nano Medical Science"
}